MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
	/* Smart Polling: 1s interval for the first 30 seconds, then 10s interval as requested */
	if (k_uptime_get_32() < 30000) {
		k_work_reschedule(&batt_work, K_SECONDS(1));
	} else {
		k_work_reschedule(&batt_work, K_SECONDS(10));
	}
}

/* --- BLE Security Callbacks --- */
static void auth_passkey_display(struct bt_conn *conn, unsigned int passkey)
{
	char addr[BT_ADDR_LE_STR_LEN];
	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));
	printk("*********************************\n");
	printk("STATIC PASSKEY REQUIRED: %06u\n", passkey);
	printk("*********************************\n");
}

static void auth_cancel(struct bt_conn *conn)
{
	char addr[BT_ADDR_LE_STR_LEN];
	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));
	printk("Pairing cancelled: %s\n", addr);
}

static void pairing_complete(struct bt_conn *conn, bool bonded)
{
	printk("Pairing complete. Bonded: %s\n", bonded ? "yes" : "no");
}

static void pairing_failed(struct bt_conn *conn, enum bt_security_err reason)
{
	printk("Pairing failed (reason %d)\n", reason);
}

static struct bt_conn_auth_cb auth_cb_display = {
	.passkey_display = auth_passkey_display,
	.passkey_entry = NULL,
	.cancel = auth_cancel,
};

static struct bt_conn_auth_info_cb auth_info_cb = {
	.pairing_complete = pairing_complete,
	.pairing_failed = pairing_failed,
};

/* Set TX Power via Nordic HCI VS Command */
static int set_bt_tx_power(int8_t power_dbm) {
    struct net_buf *buf, *rsp = NULL;
    struct bt_hci_cp_vs_write_tx_power_level *cp;
    struct bt_hci_rp_vs_write_tx_power_level *rp;
    int err;

    /* Create HCI Command (Vendor Specific for nRF) */
    buf = bt_hci_cmd_create(BT_HCI_OP_VS_WRITE_TX_POWER_LEVEL, sizeof(*cp));
    if (!buf) {
        printk("Unable to allocate command buffer\n");
        return -ENOBUFS;
    }

    cp = net_buf_add(buf, sizeof(*cp));
    cp->handle_type = BT_HCI_VS_LL_HANDLE_TYPE_ADV; /* Advertising Set */
    cp->handle = 0; /* Default handle */
    cp->tx_power_level = power_dbm;

    err = bt_hci_cmd_send_sync(BT_HCI_OP_VS_WRITE_TX_POWER_LEVEL, buf, &rsp);
    if (err) {
        printk("Set TX Power HCI failed (%d), assuming static config. Target: %d dBm\n", err, power_dbm);
        tx_power_level = power_dbm;
        return 0; // Fake success to continue logic
    }

    if (rsp) {
        rp = (void *)rsp->data;
        printk("Set TX Power success. Selected: %d dBm\n", rp->selected_tx_power);
        tx_power_level = rp->selected_tx_power; /* Update global variable for reporting */
        net_buf_unref(rsp);
    }
    return 0;
}

static int16_t sample_buffer[1];
static struct adc_sequence sequence = {
	.buffer = sample_buffer,
	.buffer_size = sizeof(sample_buffer),
};

/* Filter storage */
#define FILTER_SIZE 12
static int32_t adc_history[FILTER_SIZE] = {0};
static int filter_idx = 0;
static bool filter_full = false;

static void ccc_cfg_changed(const struct bt_gatt_attr *attr, uint16_t value) {}

static ssize_t read_tx_power(struct bt_conn *conn, const struct bt_gatt_attr *attr,
			     void *buf, uint16_t len, uint16_t offset)
{
	/* Report our last known tx_power_level which is set via Nordic VS commands in update_tx_power_based_on_battery_impl */
	return bt_gatt_attr_read(conn, attr, buf, len, offset, &tx_power_level, sizeof(tx_power_level));
}

static ssize_t read_battery(struct bt_conn *conn, const struct bt_gatt_attr *attr,
			     void *buf, uint16_t len, uint16_t offset)
{
	return bt_gatt_attr_read(conn, attr, buf, len, offset, &battery_status, sizeof(battery_status));
}

static ssize_t write_reset(struct bt_conn *conn, const struct bt_gatt_attr *attr,
			 const void *buf, uint16_t len, uint16_t offset, uint8_t flags)
{
	if (len != 1) return BT_GATT_ERR(BT_ATT_ERR_INVALID_ATTRIBUTE_LEN);
	uint8_t val = ((uint8_t *)buf)[0];
	if (val == 1) {
		printk("SYSTEM RESET TO BOOTLOADER REQUESTED...\n");
		nrf_power_gpregret_set(NRF_POWER, 0, 0x57);
		NVIC_SystemReset();
	}
	if (val == 3) {
		printk("DEEP SLEEP TRIGGERED VIA RESET CHAR\n");
		oled_settings.deepsleep_enable = 1;
		k_work_cancel_delayable(&deepsleep_work);
		k_work_reschedule(&deepsleep_work, K_MSEC(200));
	}
	if (val == 4) {
		printk("WAKE FROM DEEP SLEEP VIA RESET CHAR\n");
		wake_from_deep_sleep();
	}
	return len;
}

static void oled_apply_settings(void)
{
	if (device_is_ready(oled_dev)) {
		display_set_contrast(oled_dev, oled_settings.contrast);
		display_set_pixel_format(oled_dev, oled_settings.invert ? PIXEL_FORMAT_MONO10 : PIXEL_FORMAT_MONO01);
		if (oled_settings.display_sleep_min == 0) {
			display_blanking_off(oled_dev);
		}
	}
	oled_last_activity = k_uptime_get();
	printk("OLED settings applied: contrast=%u invert=%u sleep=%umin led=%u\n",
	       oled_settings.contrast, oled_settings.invert, oled_settings.display_sleep_min, oled_settings.led_enable);
}

static ssize_t read_oled_settings(struct bt_conn *conn, const struct bt_gatt_attr *attr,
				  void *buf, uint16_t len, uint16_t offset)
{
	return bt_gatt_attr_read(conn, attr, buf, len, offset, &oled_settings, sizeof(oled_settings));
}

static ssize_t write_oled_settings(struct bt_conn *conn, const struct bt_gatt_attr *attr,
				   const void *buf, uint16_t len, uint16_t offset, uint8_t flags)
{
	if (offset + len > sizeof(oled_settings))
		return BT_GATT_ERR(BT_ATT_ERR_INVALID_OFFSET);
	memcpy((uint8_t *)&oled_settings + offset, buf, len);
	oled_apply_settings();
	k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
	if (!oled_settings.deepsleep_enable) {
		k_work_cancel_delayable(&deepsleep_work);
		printk("Deepsleep disabled\n");
	}
	printk("OLED settings updated\n");
	return len;
}

/* Service declaration */
BT_GATT_SERVICE_DEFINE(custom_svc,
	BT_GATT_PRIMARY_SERVICE(BT_UUID_CUSTOM_SERVICE),
	/* Kein AUTHEN mehr: Windows-Bonding-Konflikt verhindert Verbindung nach erneutem Pairing */
	BT_GATT_CHARACTERISTIC(BT_UUID_ACCEL_CHRC, BT_GATT_CHRC_NOTIFY, BT_GATT_PERM_READ, NULL, NULL, NULL),
	BT_GATT_CCC(ccc_cfg_changed, BT_GATT_PERM_READ | BT_GATT_PERM_WRITE),
	BT_GATT_CHARACTERISTIC(BT_UUID_GYRO_CHRC, BT_GATT_CHRC_NOTIFY, BT_GATT_PERM_READ, NULL, NULL, NULL),
	BT_GATT_CCC(ccc_cfg_changed, BT_GATT_PERM_READ | BT_GATT_PERM_WRITE),
	BT_GATT_CHARACTERISTIC(BT_UUID_AUDIO_CHRC, BT_GATT_CHRC_NOTIFY, BT_GATT_PERM_READ, NULL, NULL, NULL),
	BT_GATT_CCC(ccc_cfg_changed, BT_GATT_PERM_READ | BT_GATT_PERM_WRITE),
	BT_GATT_CHARACTERISTIC(BT_UUID_AUDIO_STREAM_CHRC, BT_GATT_CHRC_NOTIFY, BT_GATT_PERM_READ, NULL, NULL, NULL),
	BT_GATT_CCC(ccc_cfg_changed, BT_GATT_PERM_READ | BT_GATT_PERM_WRITE),
	BT_GATT_CHARACTERISTIC(BT_UUID_TX_POWER_CHRC, BT_GATT_CHRC_READ | BT_GATT_CHRC_NOTIFY, BT_GATT_PERM_READ, read_tx_power, NULL, NULL),
	BT_GATT_CCC(ccc_cfg_changed, BT_GATT_PERM_READ | BT_GATT_PERM_WRITE),
	BT_GATT_CHARACTERISTIC(BT_UUID_BATTERY_CHRC, BT_GATT_CHRC_READ | BT_GATT_CHRC_NOTIFY, BT_GATT_PERM_READ, read_battery, NULL, NULL),
	BT_GATT_CCC(ccc_cfg_changed, BT_GATT_PERM_READ | BT_GATT_PERM_WRITE),
	BT_GATT_CHARACTERISTIC(BT_UUID_RESET_CHRC, BT_GATT_CHRC_WRITE, BT_GATT_PERM_WRITE, NULL, write_reset, NULL),
	BT_GATT_CHARACTERISTIC(BT_UUID_OLED_SETTINGS_CHRC, BT_GATT_CHRC_READ | BT_GATT_CHRC_WRITE,
			       BT_GATT_PERM_READ | BT_GATT_PERM_WRITE, read_oled_settings, write_oled_settings, &oled_settings),
);

