MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
/* --- Calibration & Timing --- */
static float calibration_factor = 2.961f; /* Standard 1M/510k divider */
#define BURST_SAMPLES 2                   /* Reduziert von 10, um Blocking zu minimieren */

static void read_battery_voltage_impl(void)
{
	int err;
	int32_t raw_sum = 0;
	int32_t val_mv;
	int samples_taken = 0;

	if (!adc_is_ready_dt(&adc_channel) || !device_is_ready(gpio0_dev)) {
		printk("Devices not ready for Batt read\n");
		return;
	}

	/* 1. Hardware vorbereiten */
	err = gpio_pin_configure(gpio0_dev, READ_BAT_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio0_dev, READ_BAT_PIN, 0);
	k_msleep(50); /* Erhöht auf 50ms zum sauberen Einschwingen des Teilers */

	err = adc_channel_setup_dt(&adc_channel);
	if (err != 0) {
		gpio_pin_configure(gpio0_dev, READ_BAT_PIN, GPIO_INPUT);
		return;
	}

	/* 2. Burst-Messung */
	for (int i = 0; i < BURST_SAMPLES; i++) {
		(void)adc_sequence_init_dt(&adc_channel, &sequence);
		err = adc_read(adc_channel.dev, &sequence);
		if (err == 0) {
			int32_t m_mv = sample_buffer[0];
			adc_raw_to_millivolts_dt(&adc_channel, &m_mv);
			raw_sum += m_mv;
			samples_taken++;
		}
		k_msleep(10);
	}
	
	/* 3. Hardware sofort wieder aus */
	gpio_pin_configure(gpio0_dev, READ_BAT_PIN, GPIO_INPUT);

	if (samples_taken > 0) {
		val_mv = raw_sum / samples_taken;
		
		/* 4. Kalibrierung anwenden */
		val_mv = (int32_t)((float)val_mv * calibration_factor);

		int32_t old_val = (int32_t)battery_status.voltage_mv;

		/* 5. Bei erstmaligem oder großem Sprung (>500mV) SMA-Filter sofort füllen */
		if (old_val == 0 || abs(val_mv - old_val) > 500) {
			for (int i = 0; i < FILTER_SIZE; i++) {
				adc_history[i] = val_mv;
			}
			filter_idx = 0;
			filter_full = true;
		} else {
			/* SMA Filter (Langzeit-Glättung) */
			adc_history[filter_idx] = val_mv;
			filter_idx = (filter_idx + 1) % FILTER_SIZE;
			if (filter_idx == 0) filter_full = true;

			int32_t sum = 0;
			int count = filter_full ? FILTER_SIZE : filter_idx;
			for (int i = 0; i < count; i++) {
				sum += adc_history[i];
			}
			val_mv = sum / count;
		}

		battery_status.voltage_mv = (uint16_t)val_mv;

		/* SoC Logic: 3.3V to 4.15V LiPo range */
		if (val_mv >= 4150) battery_status.soc = 100;
		else if (val_mv <= 3300) battery_status.soc = 0;
		else battery_status.soc = (uint8_t)((val_mv - 3300) * 100 / (4150 - 3300));
	}
}

static void update_tx_power_based_on_battery_impl(void)
{
	/* High power if > 20% OR on external power */
	int8_t target_power;
	if (battery_status.soc < 20 && battery_status.status == 0) {
		target_power = -4;
	} else {
		target_power = 8;
	}
	
	if (tx_power_level != target_power) {
		printk("Power Logic: SoC %d%% Status %d -> Set TX %d dBm\n", 
			battery_status.soc, battery_status.status, target_power);
		set_bt_tx_power(target_power);
	}

	/* Notify Battery Data */
	bt_gatt_notify(NULL, &custom_svc.attrs[IDX_BATTERY_VAL], &battery_status, sizeof(battery_status));
}

static uint32_t generated_passkey = 0;
static char device_name_with_pin[32] = "Skynet AI Beacon";

static struct bt_data ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
	BT_DATA(BT_DATA_NAME_COMPLETE, device_name_with_pin, 16) /* Name ins Hauptpaket für Smartphones */
};

static struct bt_data sd[] = {
	BT_DATA_BYTES(BT_DATA_UUID128_ALL, BT_UUID_CUSTOM_SERVICE_VAL), /* UUID ins Scan-Response */
};

/* Forward reference for advertising work */
static struct k_work adv_start_work;
static void adv_start_handler(struct k_work *work);

static void connected(struct bt_conn *conn, uint8_t err)
{
	if (err) {
		printk("Connection failed (err 0x%02x)\n", err);
	} else {
		printk("Connected.\n");
		bt_connected_flag = true;
		oled_phase = PHASE_CONNECTED;
		oled_sub_phase = 0;
		page_start_time = k_uptime_get();
		imu_view_start = k_uptime_get();
		oled_check_sleep();
		k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
	}
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
	printk("Disconnected (reason 0x%02x)\n", reason);
	bt_connected_flag = false;
	oled_phase = PHASE_BEACON;
	oled_sub_phase = 0;
	k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
	start_advertising();
}

BT_CONN_CB_DEFINE(conn_callbacks) = {
	.connected = connected,
	.disconnected = disconnected,
};

static void phy_update(struct bt_conn *conn, struct bt_conn_le_phy_info *param)
{
	printk("PHY update: TX PHY %d, RX PHY %d\n", param->tx_phy, param->rx_phy);
}

static struct bt_conn_cb conn_callbacks_phy = {
	.le_phy_updated = phy_update,
};

static void start_advertising(void)
{
	int err;

	err = bt_le_adv_stop();
	if (err < 0 && err != -EALREADY) {
		printk("Adv stop err: %d\n", err);
	}

	k_sleep(K_MSEC(50));

	struct bt_le_adv_param adv_param = {
		.id = BT_ID_DEFAULT,
		.sid = 0,
		.options = BT_LE_ADV_OPT_CONN,
		.interval_min = BT_GAP_ADV_FAST_INT_MIN_2,
		.interval_max = BT_GAP_ADV_FAST_INT_MAX_2,
	};

	err = bt_le_adv_start(&adv_param, ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));
	if (err) {
		printk("Advertising failed to start (err %d)\n", err);
	} else {
		printk("Advertising started. Skynet Beacon is visible.\n");
	}
}

static void adv_start_handler(struct k_work *work)
{
	start_advertising();
}

static void bt_ready_init(void)
{
		/* RGB Startup Sequence: R->G->B fade pulse, 10 cycles */
	for (int i = 0; i < 10; i++) {
		const struct gpio_dt_spec *specs[] = {&led_red_spec, &led_green_spec, &led_blue_spec};
		for (int s = 0; s < 3; s++) {
			if (!gpio_is_ready_dt(specs[s])) continue;

			/* Pseudo-fade using quick pulses (approx 75ms total per color) */
			for (int j = 0; j < 8; j++) { /* Fade Up */
				gpio_pin_set_dt(specs[s], 1);
				k_usleep(j * 550);
				gpio_pin_set_dt(specs[s], 0);
				k_usleep((8 - j) * 550);
			}
			gpio_pin_set_dt(specs[s], 1);
			k_msleep(15); /* Peak */
			for (int j = 8; j > 0; j--) { /* Fade Down */
				gpio_pin_set_dt(specs[s], 1);
				k_usleep(j * 550);
				gpio_pin_set_dt(specs[s], 0);
				k_usleep((8 - j) * 550);
			}
			gpio_pin_set_dt(specs[s], 0);
			k_msleep(50); /* Gap */
		}
	}	

	set_bt_tx_power(8);

	snprintf(device_name_with_pin, sizeof(device_name_with_pin), "Skynet AI Beacon");
	ad[1].data_len = strlen(device_name_with_pin);

