MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
	printk("************************************************\n");
	printk("SECURITY: Passkey Display (L4) enabled\n");
	printk("************************************************\n");

	start_advertising();
}

static int32_t my_sensor_value_to_milli(const struct sensor_value *val) { return (val->val1 * 1000) + (val->val2 / 1000); }

/* --- Audio Streaming --- */
K_MEM_SLAB_DEFINE(audio_mem_slab, 1024, 24, 4);

static struct k_thread sensor_thread_data;
K_THREAD_STACK_DEFINE(sensor_stack, 2048);

/* Deepsleep: OLED-only cycling, threads keep running for BLE stability */
#define DEEPSLEEP_DATA_WINDOW_MS 2500
static volatile bool deepsleep_pending;
static uint32_t deepsleep_sec_save;
static volatile bool deepsleep_block_notify;
static volatile bool deepsleep_send_once_audio;
static volatile bool deepsleep_send_once_sensor;

static void deepsleep_oled_sleep(void)
{
	if (!device_is_ready(oled_dev)) return;
	display_blanking_on(oled_dev);
}

static void deepsleep_oled_wake(void)
{
	if (!device_is_ready(oled_dev)) return;
	display_blanking_off(oled_dev);
	display_set_contrast(oled_dev, oled_settings.contrast);
	display_set_pixel_format(oled_dev, oled_settings.invert ? PIXEL_FORMAT_MONO10 : PIXEL_FORMAT_MONO01);
	oled_clear();
	oled_flush();
}

static void enter_deep_sleep(uint32_t sec)
{
	printk("DEEP SLEEP: entering cyclic OLED sleep interval=%us oled=%u\n", sec, oled_settings.deepsleep_oled);

	oled_settings.deepsleep_enable = 1;
	nrf_power_gpregret_set(NRF_POWER, 0, DEEP_SLEEP_MAGIC);
	nrf_power_gpregret_set(NRF_POWER, 1, oled_settings.deepsleep_interval);

	deepsleep_sec_save = sec;
	deepsleep_pending = true;
}

static void deepsleep_work_handler(struct k_work *work)
{
	if (oled_settings.deepsleep_enable) {
		enter_deep_sleep(deepsleep_interval_sec(oled_settings.deepsleep_interval));
	}
}

static void wake_from_deep_sleep(void)
{
	if (!deepsleep_pending) return;
	oled_settings.deepsleep_enable = 0;
	deepsleep_pending = false;
	deepsleep_block_notify = false;
	deepsleep_oled_wake();
	k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
	k_wakeup(main_thread_id);
	printk("WAKE FROM DEEP SLEEP completed\n");
}

static void sensor_thread(void *p1, void *p2, void *p3)
{
	struct sensor_value accel[3], gyro[3];
	int32_t ax, ay, az, gx, gy, gz;

	if (device_is_ready(imu_dev)) {
		struct sensor_value odr = { .val1 = 52, .val2 = 0 };
		sensor_attr_set(imu_dev, SENSOR_CHAN_ACCEL_XYZ, SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
		sensor_attr_set(imu_dev, SENSOR_CHAN_GYRO_XYZ, SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
	}

	while (1) {
		if (sensor_sample_fetch(imu_dev) == 0) {
			sensor_channel_get(imu_dev, SENSOR_CHAN_ACCEL_XYZ, accel);
			sensor_channel_get(imu_dev, SENSOR_CHAN_GYRO_XYZ, gyro);
			
			ax = my_sensor_value_to_milli(&accel[0]);
			ay = my_sensor_value_to_milli(&accel[1]);
			az = my_sensor_value_to_milli(&accel[2]);
			gx = my_sensor_value_to_milli(&gyro[0]);
			gy = my_sensor_value_to_milli(&gyro[1]);
			gz = my_sensor_value_to_milli(&gyro[2]);
			
			sys_put_le32(ax, &accel_data.data[0]);
			sys_put_le32(ay, &accel_data.data[4]);
			sys_put_le32(az, &accel_data.data[8]);
			sys_put_le32(gx, &gyro_data.data[0]);
			sys_put_le32(gy, &gyro_data.data[4]);
			sys_put_le32(gz, &gyro_data.data[8]);
			
			if (deepsleep_send_once_sensor) {
				deepsleep_send_once_sensor = false;
				bt_gatt_notify(NULL, &custom_svc.attrs[IDX_ACCEL_VAL], &accel_data, sizeof(accel_data));
				bt_gatt_notify(NULL, &custom_svc.attrs[IDX_GYRO_VAL], &gyro_data, sizeof(gyro_data));
			} else if (!deepsleep_block_notify) {
				bt_gatt_notify(NULL, &custom_svc.attrs[IDX_ACCEL_VAL], &accel_data, sizeof(accel_data));
				bt_gatt_notify(NULL, &custom_svc.attrs[IDX_GYRO_VAL], &gyro_data, sizeof(gyro_data));
			}
		}
		k_msleep(20); /* Wiederhergestellt auf 50Hz wie vom User gewünscht */
	}
}

/* --- NFC Logic --- */
static uint8_t nfc_ndef_msg_buf[256]; /* Vergrößert auf 256 Bytes */

static void nfc_callback(void *context, nfc_t2t_event_t event, const uint8_t *data, size_t data_len)
{
	switch (event) {
	case NFC_T2T_EVENT_FIELD_ON:
		printk("NFC: Field detected (Smartphone nearby)\n");
		break;
	case NFC_T2T_EVENT_FIELD_OFF:
		printk("NFC: Field lost\n");
		break;
	default:
		break;
	}
}

static int setup_nfc(void)
{
	int err;
	size_t len = sizeof(nfc_ndef_msg_buf);

	err = nfc_t2t_setup(nfc_callback, NULL);
	if (err) {
		printk("NFC setup failed (err %d)\n", err);
		return err;
	}

	/* Create URI Record with dynamic PIN */
	char url[128];
	snprintf(url, sizeof(url), "mikeprostudio.github.io/nRF52840-Bluetooth-Sensor-Hub/?pin=%06u", generated_passkey);

	err = nfc_ndef_uri_msg_encode(NFC_URI_HTTPS, url, strlen(url), nfc_ndef_msg_buf, &len);
	if (err) {
		printk("NFC NDEF encode failed (err %d)\n", err);
		return err;
	}

	err = nfc_t2t_payload_set(nfc_ndef_msg_buf, len);
	if (err) {
		printk("NFC payload set failed (err %d)\n", err);
		return err;
	}

	err = nfc_t2t_emulation_start();
	if (err) {
		printk("NFC emulation start failed (err %d)\n", err);
		return err;
	}

	printk("NFC URI Tag ready. URL: https://%s\n", url);
	return 0;
}

/* --- OLED Display Functions --- */
static void oled_set_pixel(int16_t x, int16_t y, uint8_t on)
{
	if (x < 0 || x >= OLED_W || y < 0 || y >= OLED_H) return;
	uint16_t page = (uint16_t)y / 8;
	uint8_t bit = (uint8_t)(y % 8);
	uint16_t idx = page * OLED_W + (uint16_t)x;
	if (on) oled_fb[idx] |= (1 << bit);
	else    oled_fb[idx] &= ~(1 << bit);
}

static void oled_putc_w(int16_t x, int16_t y, char c, uint8_t w)
{
	if (c < 0x20 || c > 0x7E) c = ' ';
	if (w > 8) w = 8;
	uint8_t idx = c - 0x20;
	for (int row = 0; row < 8; row++) {
		int16_t cy = y + row;
		if (cy < 0 || cy >= OLED_H) continue;
		uint8_t bits = font8x8[idx][row];
		for (int col = 0; col < w; col++) {
			int16_t cx = x + col;
			if (cx >= OLED_W) break;
			if (cx >= 0 && (bits & (1 << (7 - col))))
				oled_set_pixel(cx, cy, 1);
		}
	}
}

static void oled_puts_w(int16_t x, int16_t y, const char *str, uint8_t w)
{
	while (*str) {
		oled_putc_w(x, y, *str, w);
		x += w;
		if (x + w > OLED_W) { x = 0; y += 8; }
		str++;
	}
}

