MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
static void oled_putc(int16_t x, int16_t y, char c)
{
	oled_putc_w(x, y, c, 8);
}

static void oled_puts(int16_t x, int16_t y, const char *str)
{
	oled_puts_w(x, y, str, 8);
}

static void oled_putc_8x16(int16_t x, int16_t y, char c)
{
	if (c < 0x20 || c > 0x7E) c = ' ';
	uint8_t idx = c - 0x20;
	for (int row = 0; row < 16; row++) {
		int16_t cy = y + row;
		if (cy < 0 || cy >= OLED_H) continue;
		uint8_t bits = font8x16[idx][row];
		for (int col = 0; col < 8; col++) {
			int16_t cx = x + col;
			if (cx >= OLED_W) break;
			if (cx >= 0 && (bits & (1 << (7 - col))))
				oled_set_pixel(cx, cy, 1);
		}
	}
}

static void oled_puts_8x16(int16_t x, int16_t y, const char *str)
{
	while (*str) {
		oled_putc_8x16(x, y, *str);
		x += 8;
		if (x + 8 > OLED_W) { x = 0; y += 16; }
		str++;
	}
}

static void oled_clear(void)
{
	memset(oled_fb, 0, sizeof(oled_fb));
}

static void oled_flush(void)
{
	struct display_buffer_descriptor desc = {
		.width = OLED_W,
		.height = OLED_H,
		.pitch = OLED_W,
		.buf_size = OLED_FB_SIZE,
	};
	display_write(oled_dev, 0, 0, &desc, oled_fb);
}

static int oled_init(void)
{
	if (!device_is_ready(oled_dev)) {
		printk("OLED device not ready\n");
		return -ENODEV;
	}
	display_blanking_off(oled_dev);
	oled_clear();
	oled_flush();
	if (IS_ENABLED(CONFIG_LOG)) printk("OLED initialized\n");
	return 0;
}

/* --- QR Code --- */
static void generate_qr_code(void)
{
	char url[96];
	snprintf(url, sizeof(url), "https://mikeprostudio.github.io/nRF52840-Bluetooth-Sensor-Hub/");
	qr_code_ready = qrcodegen_encodeText(url, qr_temp_buf, qr_code_buf,
	                                      qrcodegen_Ecc_LOW, 1, QR_VERSION, qrcodegen_Mask_AUTO, true);
}

static void oled_draw_qr_code(void)
{
	char buf[24];

	oled_clear();

	if (qr_code_ready) {
		int size = qrcodegen_getSize(qr_code_buf);
		int module_px = 2;
		int qr_pixels = size * module_px;
		int qr_x = 2, qr_y = (OLED_H - qr_pixels) / 2;
		for (int my = 0; my < size; my++) {
			for (int mx = 0; mx < size; mx++) {
				if (qrcodegen_getModule(qr_code_buf, mx, my)) {
					for (int dy = 0; dy < module_px; dy++) {
						for (int dx = 0; dx < module_px; dx++) {
							oled_set_pixel(qr_x + mx * module_px + dx, qr_y + my * module_px + dy, 1);
						}
					}
				}
			}
		}
	}

	int pin_x = (qr_code_ready && qrcodegen_getSize(qr_code_buf) * 2 + 2 < OLED_W)
	            ? qrcodegen_getSize(qr_code_buf) * 2 + 8 : OLED_W - 48;
	oled_puts_8x16(pin_x, (OLED_H - 32) / 2, "PIN:");
	snprintf(buf, sizeof(buf), "%06u", generated_passkey);
	oled_puts_8x16(pin_x, (OLED_H - 32) / 2 + 16, buf);

	oled_flush();
}

static void oled_update_display(void)
{
	char buf[24];

	oled_clear();

	snprintf(buf, sizeof(buf), "Skynet AI Beacon");
	oled_puts_8x16(0, 0, buf);

	snprintf(buf, sizeof(buf), "PIN: %06u", generated_passkey);
	oled_puts_8x16(0, 16, buf);

	snprintf(buf, sizeof(buf), "BAT: %umV %u%%", battery_status.voltage_mv, battery_status.soc);
	oled_puts_8x16(0, 32, buf);

	const char *status_str;
	switch (battery_status.status) {
	case 1:  status_str = "Charging";   break;
	case 2:  status_str = "USB Power";  break;
	default: status_str = "Battery";    break;
	}
	snprintf(buf, sizeof(buf), "PWR: %s", status_str);
	oled_puts_8x16(0, 48, buf);

	oled_flush();
}

/* --- OLED Mic PSD Visualization --- */
#define PSD_BINS 112
#define CHART_X 16
static uint8_t psd_ema[PSD_BINS];

static void oled_update_mic(void)
{
	uint32_t rms_raw = sys_get_le32(&audio_level_buf[0]);
	uint32_t zcr = sys_get_le32(&audio_level_buf[4]);
	double rms = (double)rms_raw / 1000.0;
	double freq_est = (double)zcr * 8000.0 / 1024.0;
	if (freq_est < 300.0) freq_est = 300.0;

	double dbfs = 20.0 * log10(rms + 0.0001);
	double dbspl = dbfs + 135.0;
	if (dbspl < 30.0) dbspl = 30.0;
	if (dbspl > 120.0) dbspl = 120.0;
	double max_bar = (dbspl - 30.0) / 90.0 * 47.0;

	oled_clear();

	for (int i = 0; i < PSD_BINS; i++) {
		double bin_freq = (double)i * 16000.0 / (double)(PSD_BINS * 2);
		double dist = bin_freq - freq_est;
		double val = exp(-(dist * dist) / 40000.0) * max_bar;
		double dist2 = bin_freq - freq_est * 2.0;
		val += exp(-(dist2 * dist2) / 20000.0) * max_bar * 0.35;
		val += exp(-(bin_freq * bin_freq) / 20000.0) * max_bar * 0.12;
		if (val < 0.3) val = 0.0;
		if (val > 47.0) val = 47.0;
		uint8_t v = (uint8_t)val;

		uint8_t ema = (uint8_t)((v > psd_ema[i]) ?
			(v * 0.5f + psd_ema[i] * 0.5f) :
			(psd_ema[i] * 0.90f));
		if (ema > 47) ema = 47;
		psd_ema[i] = ema;

		for (int y = 0; y < ema && y < 48; y++) {
			oled_set_pixel(CHART_X + i, 47 - y, 1);
		}
	}

	oled_puts_w(0, 0, "120", 4);
	oled_puts_w(0, 20, "75", 4);
	oled_puts_w(0, 39, "30", 4);
	oled_puts_w(CHART_X, 48, "0  2  4  6  8kHz", 6);
	char rms_str[16];
	snprintf(rms_str, sizeof(rms_str), "RMS %u", rms_raw);
	oled_puts_w(0, 56, rms_str, 6);

	oled_flush();
}

static void fmt_val_signed(char *buf, int32_t val)
{
	int neg = (val < 0);
	if (neg) val = -val;
	int ip = val / 1000;
	int fp = (val % 1000 + 5) / 10;
	if (fp >= 100) { ip++; fp = 0; }
	snprintf(buf, 10, "%s%d.%02u", neg ? "-" : "+", ip, (unsigned int)fp);
}

/* ── Scroll state ── */
#define SCROLL_STEPS 12
#define SCROLL_MS 30
static bool oled_scroll_active;
static uint8_t oled_scroll_step;
static uint8_t oled_scroll_from;
static uint8_t oled_scroll_to;

/* Cubic ease-out: slow start, fast middle, smooth stop */
static int ease_out_cubic(int step, int total)
{
	float t = (float)step / total;
	float eased = 1.0f - (1.0f - t) * (1.0f - t) * (1.0f - t);
	return (int)(eased * total + 0.5f);
}

/* IMU page: Acc X/Y/Z + Battery */
static void oled_render_imu_at(int y_offs)
{
	char buf[24], xs[10], ys[10], zs[10];

	int32_t ax = (int32_t)sys_get_le32(&accel_data.data[0]);
	int32_t ay = (int32_t)sys_get_le32(&accel_data.data[4]);
	int32_t az = (int32_t)sys_get_le32(&accel_data.data[8]);

	fmt_val_signed(xs, ax); fmt_val_signed(ys, ay); fmt_val_signed(zs, az);

	snprintf(buf, sizeof(buf), "Acc X%sm/s2", xs);
	oled_puts_8x16(0, 0 + y_offs, buf);
	snprintf(buf, sizeof(buf), "Acc Y%sm/s2", ys);
	oled_puts_8x16(0, 16 + y_offs, buf);
	snprintf(buf, sizeof(buf), "Acc Z%sm/s2", zs);
	oled_puts_8x16(0, 32 + y_offs, buf);
	snprintf(buf, sizeof(buf), "Bat %umV %u%%", battery_status.voltage_mv, battery_status.soc);
	oled_puts_8x16(0, 48 + y_offs, buf);
}

