MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
/* Gyro page: Gyr X, Y, Z each on own line + Power/TX */
static void oled_render_power_at(int y_offs)
{
	char buf[24], gxs[10], gys[10], gzs[10];

	int32_t gx = (int32_t)sys_get_le32(&gyro_data.data[0]);
	int32_t gy = (int32_t)sys_get_le32(&gyro_data.data[4]);
	int32_t gz = (int32_t)sys_get_le32(&gyro_data.data[8]);

	fmt_val_signed(gxs, gx); fmt_val_signed(gys, gy); fmt_val_signed(gzs, gz);

	const char *pwr;
	switch (battery_status.status) {
	case 1:  pwr = "CHG";  break;
	case 2:  pwr = "USB";  break;
	default: pwr = "BAT";  break;
	}

	snprintf(buf, sizeof(buf), "Gyr X%sd/s", gxs);
	oled_puts_8x16(0, 0 + y_offs, buf);
	snprintf(buf, sizeof(buf), "Gyr Y%sd/s", gys);
	oled_puts_8x16(0, 16 + y_offs, buf);
	snprintf(buf, sizeof(buf), "Gyr Z%sd/s", gzs);
	oled_puts_8x16(0, 32 + y_offs, buf);
	snprintf(buf, sizeof(buf), "P:%s TX %ddBm", pwr, tx_power_level);
	oled_puts_8x16(0, 48 + y_offs, buf);
}

/* Static display wrappers */
static void oled_show_imu(void)
{
	oled_clear();
	oled_render_imu_at(0);
	oled_flush();
}

static void oled_show_power(void)
{
	oled_clear();
	oled_render_power_at(0);
	oled_flush();
}

/* Scroll animation: new content scrolls DOWN from above into view.
   Old content goes the opposite direction (UP) out of view. */

static void oled_scroll_frame(void)
{
	int total = SCROLL_STEPS;
	int pos = ease_out_cubic(oled_scroll_step, total);
	int from_offs = -pos;           /* 0 → -64: old scrolls UP out (opposite of entry) */
	int to_offs = pos - OLED_H;     /* -64 → 0: new scrolls DOWN into view from above */

	oled_clear();
	if (oled_scroll_from == 0) oled_render_imu_at(from_offs);
	else oled_render_power_at(from_offs);
	if (oled_scroll_to == 0) oled_render_imu_at(to_offs);
	else oled_render_power_at(to_offs);
	oled_flush();

	oled_scroll_step++;
	if (oled_scroll_step >= total) {
		oled_scroll_active = false;
	}
}

static void oled_check_sleep(void)
{
	oled_last_activity = k_uptime_get();
	if (oled_settings.display_sleep_min > 0 && device_is_ready(oled_dev)) {
		display_blanking_off(oled_dev);
	}
}

static void oled_work_handler(struct k_work *work)
{
	if (oled_settings.display_sleep_min > 0 &&
	    k_uptime_get() - oled_last_activity > (int64_t)oled_settings.display_sleep_min * 60000) {
		if (device_is_ready(oled_dev)) {
			display_blanking_on(oled_dev);
		}
		k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(30));
		return;
	}

	if (oled_phase == PHASE_WELCOME) {
		oled_clear();
		oled_puts_8x16(20, 24, "Welcome!");
		oled_flush();
		generate_qr_code();
		oled_sub_phase = 0;
		if (oled_settings.qr_enable) {
			oled_phase = PHASE_QR;
			qr_view_start = k_uptime_get();
		} else {
			oled_phase = PHASE_BEACON;
		}
		oled_last_activity = k_uptime_get();
		k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(2));
	} else if (bt_connected_flag) {
		oled_last_activity = k_uptime_get();
		uint64_t now = k_uptime_get();

		/* During active scroll, advance animation step */
		if (oled_scroll_active) {
			oled_scroll_frame();
			if (oled_scroll_active) {
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(SCROLL_MS));
			} else {
				/* Scroll finished — show target page and start its timer */
				page_start_time = now;
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
			}
		} else if (oled_sub_phase == 0) {
			/* Acc page: Acc X/Y/Z + Battery */
			oled_show_imu();
			if (oled_settings.view_override == 2) {
				oled_scroll_from = 0; oled_scroll_to = 2;
				oled_scroll_step = 0; oled_scroll_active = true;
				oled_sub_phase = 2;
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
			} else if (oled_settings.view_override == 1) {
				if (now - page_start_time >= (uint64_t)oled_settings.imu_dwell_s * 1000) {
					oled_scroll_from = 0; oled_scroll_to = 1;
					oled_scroll_step = 0; oled_scroll_active = true;
					oled_sub_phase = 1;
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
				} else {
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
				}
			} else {
				if (now - page_start_time >= (uint64_t)oled_settings.imu_dwell_s * 1000) {
					oled_scroll_from = 0; oled_scroll_to = 1;
					oled_scroll_step = 0; oled_scroll_active = true;
					oled_sub_phase = 1;
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
				} else {
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
				}
			}
		} else if (oled_sub_phase == 1) {
			/* Gyro page: Gyr X/Y/Z (each own line) + Pwr/TX */
			oled_show_power();
			if (oled_settings.view_override == 2) {
				oled_scroll_from = 1; oled_scroll_to = 2;
				oled_scroll_step = 0; oled_scroll_active = true;
				oled_sub_phase = 2;
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
			} else if (oled_settings.view_override == 1) {
				if (now - page_start_time >= (uint64_t)oled_settings.power_dwell_s * 1000) {
					oled_scroll_from = 1; oled_scroll_to = 0;
					oled_scroll_step = 0; oled_scroll_active = true;
					oled_sub_phase = 0;
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
				} else {
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
				}
			} else {
				if (now - page_start_time >= (uint64_t)oled_settings.power_dwell_s * 1000) {
					oled_scroll_from = 1; oled_scroll_to = 2;
					oled_scroll_step = 0; oled_scroll_active = true;
					oled_sub_phase = 2;
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
				} else {
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
				}
			}
		} else {
			/* Mic PSD page */
			oled_update_mic();
			if (oled_settings.view_override == 2) {
				/* Stay in mic */
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
			} else {
				/* Auto or Dashboard: cycle back to IMU */
				if (now - page_start_time >= (uint64_t)oled_settings.mic_dwell_s * 1000) {
					oled_scroll_from = 2; oled_scroll_to = 0;
					oled_scroll_step = 0; oled_scroll_active = true;
					oled_sub_phase = 0;
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
				} else {
					k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
				}
			}
		}
	} else if (oled_phase == PHASE_QR && oled_settings.qr_enable) {
		oled_draw_qr_code();
		if (k_uptime_get() - qr_view_start < (int64_t)oled_settings.qr_dwell_s * 1000) {
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(500));
		} else {
			oled_phase = PHASE_BEACON;
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
		}
	} else {
		oled_update_display();
		oled_sub_phase = 0;
		if (oled_settings.view_override == 1 || !oled_settings.qr_enable) {
			oled_phase = PHASE_BEACON;
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(oled_settings.beacon_dwell_s));
		} else {
			oled_phase = PHASE_QR;
			qr_view_start = k_uptime_get();
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(oled_settings.beacon_dwell_s));
		}
	}
}

int main(void) {
	main_thread_id = k_current_get();
	if (gpio_is_ready_dt(&led_red_spec)) { gpio_pin_configure_dt(&led_red_spec, GPIO_OUTPUT_INACTIVE); }
	if (gpio_is_ready_dt(&led_green_spec)) { gpio_pin_configure_dt(&led_green_spec, GPIO_OUTPUT_INACTIVE); }
	if (gpio_is_ready_dt(&led_blue_spec)) { gpio_pin_configure_dt(&led_blue_spec, GPIO_OUTPUT_INACTIVE); }

