MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
	nrf_power_resetreas_clear(NRF_POWER,
		NRF_POWER_RESETREAS_OFF_MASK | NRF_POWER_RESETREAS_DOG_MASK);
	if (nrf_power_gpregret_get(NRF_POWER, 0) == DEEP_SLEEP_MAGIC) {
		oled_settings.deepsleep_enable = 1;
		oled_settings.deepsleep_interval = nrf_power_gpregret_get(NRF_POWER, 1);
		nrf_power_gpregret_set(NRF_POWER, 0, 0);
		nrf_power_gpregret_set(NRF_POWER, 1, 0);
		printk("WOKE FROM DEEP SLEEP (interval idx %u)\n", oled_settings.deepsleep_interval);
	}

	usb_enable(NULL);

	bt_conn_auth_cb_register(&auth_cb_display);
	bt_conn_auth_info_cb_register(&auth_info_cb);

	/* Generate a unique, constant 6-digit PIN from Hardware FICR DeviceAddress */
	generated_passkey = (nrf_ficr_deviceaddr_get(NRF_FICR, 0) % 900000) + 100000;
	bt_passkey_set(generated_passkey);
	printk("----------------------------------\n");
	printk("DEVICE UNIQUE PIN: %06u\n", generated_passkey);
	printk("----------------------------------\n");

	/* Settings müssen VOR bt_enable() geladen werden, damit die BT-Identität (BLE-Address)
	   aus NVS restaured wird und nach Power-Cycle gleich bleibt */
	if (IS_ENABLED(CONFIG_BT_SETTINGS)) {
		settings_load();
	}

	int err = bt_enable(NULL);
	if (err) {
		printk("Bluetooth init failed (err %d)\n", err);
		return 0;
	}

	bt_conn_cb_register(&conn_callbacks_phy);

	/* Initialize NFC after BT is ready so we can fetch the device address */
	setup_nfc();

	/* Initialize OLED display */
	oled_init();
	oled_apply_settings();

	k_work_init(&adv_start_work, adv_start_handler);

	bt_ready_init();

	{
		static const struct audio_stream_config stream_cfg = {
			.mic_dev = DEVICE_DT_GET(DT_ALIAS(mic)),
			.gpio1_dev = DEVICE_DT_GET(DT_NODELABEL(gpio1)),
			.led_red = &led_red_spec,
			.led_green = &led_green_spec,
			.led_blue = &led_blue_spec,
			.audio_level_buf = audio_level_buf,
			.mem_slab = &audio_mem_slab,
			.gatt_attrs = custom_svc.attrs,
			.audio_val_idx = IDX_AUDIO_VAL,
			.audio_stream_val_idx = IDX_AUDIO_STREAM_VAL,
			.bt_connected = &bt_connected_flag,
			.deepsleep_block_notify = &deepsleep_block_notify,
			.deepsleep_send_once_audio = &deepsleep_send_once_audio,
			.oled_settings = &oled_settings,
		};
		audio_stream_start(&stream_cfg);
	}

	k_thread_create(&sensor_thread_data, sensor_stack, K_THREAD_STACK_SIZEOF(sensor_stack), sensor_thread, NULL, NULL, NULL, 3, K_FP_REGS, K_NO_WAIT);

	/* Initialize and start periodic battery monitoring */
	k_work_init_delayable(&batt_work, batt_work_handler);
	k_work_reschedule(&batt_work, K_NO_WAIT);

	/* Initialize and start periodic status monitoring */
	k_work_init_delayable(&status_work, status_work_handler);
	k_work_reschedule(&status_work, K_NO_WAIT);

	/* Initialize and start periodic OLED update */
	k_work_queue_start(&oled_work_q, oled_work_q_stack,
			   K_THREAD_STACK_SIZEOF(oled_work_q_stack),
			   4, NULL);
	k_work_init_delayable(&oled_work, oled_work_handler);
	k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(1));

	k_work_init_delayable(&deepsleep_work, deepsleep_work_handler);

	while (1) {
		if (deepsleep_pending) {
			deepsleep_block_notify = true;
			deepsleep_oled_sleep();

			while (deepsleep_pending && oled_settings.deepsleep_enable) {
				k_sleep(K_SECONDS(deepsleep_sec_save));
				if (!deepsleep_pending || !oled_settings.deepsleep_enable) break;

				deepsleep_send_once_audio = true;
				deepsleep_send_once_sensor = true;
				if (oled_settings.deepsleep_oled) {
					deepsleep_oled_wake();
				}
				k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
				k_sleep(K_MSEC(DEEPSLEEP_DATA_WINDOW_MS));

				if (!deepsleep_pending || !oled_settings.deepsleep_enable) break;
				if (oled_settings.deepsleep_oled) {
					deepsleep_oled_sleep();
				}
			}

			deepsleep_block_notify = false;
			deepsleep_pending = false;
			deepsleep_oled_wake();
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
		} else {
			k_msleep(500);
		}
	}
	return 0;
}
